thorrak/esp_wifi_config/examples/with_improv/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Use larger partition table for BLE (requires 4MB+ flash)
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# BLE Configuration
CONFIG_BT_ENABLED=y
# For BLE, choose ONE host stack:
#   Bluedroid (default, ~100KB flash / ~40KB RAM):
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=n
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
#   Or NimBLE (lighter, ~50KB flash / ~20KB RAM):
#     CONFIG_BT_NIMBLE_ENABLED=y
#     CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=6144

# WiFi Manager BLE (custom GATT protocol)
CONFIG_WIFI_CFG_ENABLE_BLE=y

# Improv WiFi (standard protocol)
CONFIG_WIFI_CFG_ENABLE_IMPROV_BLE=y
# Uncomment to also enable Improv Serial over UART:
# CONFIG_WIFI_CFG_ENABLE_IMPROV_SERIAL=y
# CONFIG_WIFI_CFG_IMPROV_SERIAL_UART_NUM=0
# CONFIG_WIFI_CFG_IMPROV_SERIAL_BAUD=115200

# Move WiFi RX/TX IRAM functions to flash to free IRAM
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n